var app=angular.module('myApp', []);

function MyCtrl($scope) {
    $scope.currentPage = 0;
    $scope.pageSize = 5;
  $scope.items = [

        {   
            id:"myModal1",
            bookid:"چوڭ گۇناھلار",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_chong_gunahlar.pdf',
title:'چوڭ گۇناھلار ناملىق بۇ ئەسەردە، مۇئەللىپ رەھىمەھۇللاھ قۇرئان ۋە سۈننەتتە بايان قىلىنغان چوڭ گۇناھلارنى دەلىل ئىسپاتلار بىلەن تەپسىلى بايان قىلىپ بېرىدۇ.'
        },
     
       
        {    
            id:"myModal2",
            bookid:"قۇرئان كەرىمدىكى تۆت ئاساسى تېرمىن",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_qoran_kerimdiki_tot_asasi_tirmin.pdf',
            title:'«قۇرئان كەرىمدىكى تۆت ئاساسى تېرمىن» ناملىق بۇ ئەسەردە، قۇرئان كەرىمنىڭ تېرمىنولوگىيىلىك ئاتالغۇلىرى ئىچىدىن مۇسۇلماننىڭ بىلىۋېلىشى ئەڭ مۇھىم بولغان، ئىلاھ، رەب، دىن، ئىبادەتدىن ئىبارەت ئىسلامىي دەۋەتنىڭ ئاساسى بولغان مەزكۇر ئاتالغۇلارغا تەپسىلى چۈشەنچە بېرىدۇ ۋە ئىنسانلارنىڭ بۇ تېرمىنلارنى چۈشۈنىشتىكى بەزى خاتالىقلىرىنى ئوقۇرمەنلەرگە ئۆچۈق يورۇتۇپ بېرىدۇ.'

        }
        ,
        {    
            id:"myModal3",
            bookid:"ئايال ساھابىلار ھاياتىدىن تاللانمىلار",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_ayal_sahabilar_hayatidin_tallanmilar.pdf',
           title:'ئايال ساھابىلار ھاياتىدىن تاللانمىلار» ناملىق بۇ ئەسەر، ئايال ساھابىلاردىن (ئاللاھ ئۇلاردىن رازى بولسۇن) 117 كىشىنىڭ شانلىق تەرجىمىھالىنىڭ قىسقىچى مەزمۇنىنى ئۆز ئىچىگە ئالغان بولۇپ، ئۇلارنىڭ ئۆلگىلىك ئىش-ئىزلىرى، ئىمانى ۋە ئىنسانى ئالاھىدىلىكلىرى، دىننى قوغداش ۋە تارىتىش يولىدا كورسەتكەن پىداكارلىقلىرى، ھىجرەت ۋە جىھاد مەزگىللىرىدىكى ئەزىيەتلەرگە سەبرى قىلىشى...قاتارلىق كۆپلىگەن گۈزەل خىسلەتلەرنى ئوقۇرمەنلەرگە ئەينەن تەسۋىرلەپ بىرىدۇ.'

        }
        ,
        {    
            id:"myModal4",
            bookid:"روزىغا ئالاقىدار ئەھكاملار",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_rozigha_alaqidar_hokumler.pdf',
          title:'روزىغا ئالاقىدار ئەھكاملار ناملىق بۇ رىسالىدە، رامىزان روزىسى ۋە نەپلە روزىلارغا دائىر بولغان بارلىق ئەھكاملار، روزىنىڭ ۋاجىب ۋە شەرتلىرى، سۈننەت ۋە مۇستەھەبلىرى، تەراۋىھ نامىزى، ئېتىكاپ ۋە سەدىقە پىتىر قاتارلىق رامىزان ئېيىدىكى مۇھىم ئەمەللەرنى قۇرئان سۈننەتنىڭ روھىغا ئۇيغۇن ھالدا تەپسىلى بايان قىلىپ بېرىدۇ.'
             }
     ,
        {    
            id:"myModal5",
            bookid:"ئىماننىڭ ئاساسلىرى",
            url: 'http://www.weebly.com/uploads/5/0/8/3/5083859/ug_iymanning_asasliri.pdf',
            title:'ئىماننىڭ ئاساسلىرى، ناملىق بۇ كىتاپ مەشھۇر ئالىم ئەللامە مۇھەممەد سالىھ ئەلئۇسەيمىننىڭ بولۇپ، ياش تەرجىمان دىنى زىيالىي ن. تەمكىنى ئەپەندىم تەرىپىدىن تەرجىمە قىلىندى. بۇ كىتاپ ئىسلام دۇنياسىدا، ئەقىدە توغرىسىدا يېزىلغان ئالدىنقى قاتاردىكى كىتابچە دەپ قارىلىدۇ. بۇ كىتابتا، ئاللاھغا توغرا رەۋىشتە ئىمان كەلتۈرۈش، پەرىشتىلەر، پەيغەمبەرلەر، ساماۋى كىتابلار، ئاخىرەت كۈنى، تەقدىر... قاتارلىق مۇھىم مەسىلىلەرگە قانداق ئىمان كەلتۇرىشىمىز كېرەكلىكىنى قۇرئان ھەدىس ۋە ئەقلى دەلىللەر بىلەن ئىسپاتلاپ بېرىدۇ. '
             }
       ,

        {    
            id:"myModal6",
            bookid:"مۆمىننىڭ ئەقىدىسى",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_mominler_aqidisi.pdf',
title:'«مۆمىننىڭ ئەقىدىسى» ناملىق بۇ ئەسەر، ئىسلام ئەقىدىسى ۋە ئۇنىڭ ئاساسىنى ئۆز ئىچىگە ئالغان بولۇپ، ئەقىدە مەسىلىلىرىنى ئىسپاتلاشتا ئەقلى ۋە شەرئى دەلىللەرنى بىرلىكتە كۆرسىتىپ بېرىش بىلەن بىرگە ھازىرقى زامان تەلىپىگە ئۇيغۇن ھالدا يېزىلغان ئالدىنقى قاتاردىكى ئەقىدە كىتابلىرىدىن سانىلىدۇ.'
             }
  ,

        {    
            id:"myModal7",
            bookid:" ئىسلام دىنىنىڭ روھى (تەۋسىيە ئەسەر)",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_islam_dinining_rohi.pdf',
          title:'«ئىسلام دىنىنىڭ روھى» ناملىق بۇ ئەسەردە ئاپتور ھەرقانداق بىر مۇسۇلماننىڭ بىلىۋېلىشى زۆرۈر بولغان كىشىلىك تۇرمۇش ۋە ئىجتىمائىي جەمئىيەتكە ئائىت ئاساسى مەزمۇننى چۆرىدىگەن ھالدا ئۆزگىچە ئۇسلۇب بىلەن ھەقىقەتنى بايان قىلىپ بېرىدۇ. ئىسلامنىڭ ئاساسى پرىنسىپىنى ئوچۇق يورۇتۇپ بېرىش بىلەن بىرگە، ئىسلام دىنىنىڭ زامان-ماكان تاللىماستىن ھەرقانداق ھازارەت بىلەن خاسلىقىنى ساقلاپ قالغان ھالدا ماسلىشىپ كېتەلەيدىغانلىقى، قۇرئان كەرىمنىڭ ئىلاھىي ۋەھيى، مۇھەممەد ئەلەيھىسسالامنىڭ راستچىل پەيغەمبەر ئىكەنلىكىگە قۇرئان كەرىمدىن ئىلمى دەلىللەرنى كەلتۈرگەندىن سىرت ئەقلى ئىسپاتلار بىلەن دەلىللەيدۇ. دىن دۈشمەنلىرى تەرىپىدىن ئويدۇرۇپ چىقىرىلغان تۆھمەت ۋە شەك-شۇبھىلەرگە ئىلمى ئۇسۇلدا ئەجەللىك زەربە بېرىدۇ.'
             }
             ,

        {    
            id:"myModal8",
            bookid:" ئىسلام دىنىنى ئومۇمى تونۇشتۇرۇش",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_islam_dinini_omumiy_tonushturush.pdf',
title:'«ئىسلام دىنىنى ئومۇمى تونۇشتۇرۇش»ناملىق بۇ ئەسەر ئىسلام دىنىنى ئەڭ ئاسان ئۇسۇل بىلەن چۇشەندۇرۇپلا قالماي؛بەلكى ئىسلامنىڭ ھەقىقى مەنىسىنى مۆمىن قەلبىدە ئۇرغۇتقۇسى.بۇ كىتاب ئۆزگىچە ئۇسلۇبى بىلەن ھەر-خىل شەيتانى خىياللارغا قانائەتلىنەرلىك ئەقلى دەلىل ۋە قۇرئان كەرىم ، ساغلام ھەدىسلەرنىڭ روھى بىلەن ئىلمى ئاساستا ھەقىقەتنى ئوتتۇرىغا قويىدۇ.'
             },
              {    
            id:"myModal9",
            bookid:"پەزىلەتلىك ئەمەل",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_faziletlik_emeller.pdf',
title:'«پەزىلەتلىك ئەمەللەر» ناملىق بۇ كىتاپتا ئاپتۇر ئىسلام دىنىدىكى ئىبادەتلەر ئەقىلغا تايانماستىن ؛بەلكى قۇرئان ۋە ھەدىسگە ئاساسلىنىدىغانلىقىنى بايان قىلىش بىلەن بىرگە، بەندىنى ئاللاھقا يىقىنلاشتۇرىدىغان، ئىنساننىڭ روھى ۋە مەنىۋىيىتىگە ۋاستسىز تەسىر كۆرسىتىدىغان ئەمەللەرنى قۇرئان ۋە ساغلام ھەدىسلەرگە ئاساسلىنىپ تۇرۇپ چۈشەنچە بېىرىدۇ.'
             }
             ,
              {    
            id:"myModal10",
            bookid:"تەنتاۋى جەۋھەرلىرىدىن تاللانمىلار",
            url: 'http://ketablar.weebly.com/uploads/5/0/8/3/5083859/ug_tentawi_jewherliridin_tallanmilar.pdf',
title:'«تەنتاۋى جەۋھەرلىرىدىن تاللانمىلار» ناملىق بۇ كىتاپ تەپسىر جەۋاھىردىن مۇھىم مەزمۇنلارنىڭ تاللانما تەرجىمىسى بولۇپ ،بۇ تەپسىر ھەر-خىل ھازارەت ۋە مەدەنىيەت كۆز قاراشلىرىدىكى جەمىيەتشۇناس ، پىسخىلوگىيە ، بىئولوگىيە ،تەبىئى پەن قاتارلىق بىلىم ئەھلىلىرىنىڭ قۇرئان كەرىمنىڭ ھەقىقىتى بىلەن تونۇشۇپ چېقىشىغا ئاساس سالغۇسى.'
             }
    ];
   
}

//We already have a limitTo filter built-in to angular,
//let's make a startFrom filter
app.filter('startFrom', function() {
    return function(input, start) {
        start = +start; //parse to int
        return input.slice(start);
    }
});
